# Group and Sort

## Import Libraries

In [22]:
import pandas as pd

## Import Dataset

In [23]:
dataset = pd.read_csv("./datasets/chickweight.csv")

In [24]:
dataset.head()

   weight  Time  Chick  Diet
0      42     0      1     1
1      51     2      1     1
2      59     4      1     1
3      64     6      1     1
4      76     8      1     1

## Groupwise Analysis

In [25]:
dataset.count()

weight    578
Time      578
Chick     578
Diet      578
dtype: int64

In [26]:
grouped_dataset = dataset.groupby(["Diet", "Chick"]).weight.agg([min, max])
grouped_dataset.head()

            min  max
Diet Chick
1    1       42  205
     2       40  215
     3       39  202
     4       42  160
     5       41  223

Reset the multiple indexes created with `groupby`

In [29]:
grouped_dataset = grouped_dataset.reset_index()
grouped_dataset.head()

   index  Diet  Chick  min  max
0      0     1      1   42  205
1      1     1      2   40  215
2      2     1      3   39  202
3      3     1      4   42  160
4      4     1      5   41  223

## Sorting

In [28]:
grouped_dataset.sort_values(by="min").head()

    Diet  Chick  min  max
17     1     18   35   39
35     3     36   39  227
26     2     27   39  192
2      1      3   39  202
47     4     48   39  322